Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX1025MTSH128S1.svd
            <register>
               <name>WDT0_IER</name>
               <description>Watchdog 0 Interrupt Enable Register</description>
               <addressOffset>0x1224</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PERINT</name>
                     <description>Overflow Period Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RPTHINT</name>
                     <description>Reload Repeat Period Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLINT</name>
                     <description>Interrupt Level Threshold Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>W1PERINT</name>
                     <description>Watchdog 1 Overflow Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>W1RPTHINT</name>
                     <description>Watchdog 1 Repeat Threshold Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLDERR</name>
                     <description>Reload Command Error Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT0_IDR</name>
               <description>Watchdog 0 Interrupt Disable Register</description>
               <addressOffset>0x1228</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PERINT</name>
                     <description>Overflow Period Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RPTHINT</name>
                     <description>Reload Repeat Period Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLINT</name>
                     <description>Interrupt Level Threshold Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>W1PERINT</name>
                     <description>Watchdog 1 Overflow Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>W1RPTHINT</name>
                     <description>Watchdog 1 Repeat Threshold Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLDERR</name>
                     <description>Reload Command Error Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT0_ISR</name>
               <description>Watchdog 0 Interrupt Status Register</description>
               <addressOffset>0x122C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PERINT</name>
                     <description>Overflow Period Status (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RPTHINT</name>
                     <description>Reload Repeat Period Status (cleared on read)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLINT</name>
                     <description>Interrupt Level Threshold Status (cleared on read)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>W1PERINT</name>
                     <description>Watchdog 1 Overflow Interrupt Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>W1RPTHINT</name>
                     <description>Watchdog 1 Repeat Threshold Interrupt Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLDERR</name>
                     <description>Reload Command Error Status (cleared on read)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT0_IMR</name>
               <description>Watchdog 0 Interrupt Mask Register</description>
               <addressOffset>0x1230</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PERINT</name>
                     <description>Overflow Period Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RPTHINT</name>
                     <description>Reload Repeat Period Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLINT</name>
                     <description>Interrupt Level Threshold Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>W1PERINT</name>
                     <description>Watchdog 1 Overflow Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>W1RPTHINT</name>
                     <description>Watchdog 1 Repeat Threshold Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLDERR</name>
                     <description>Reload Command Error Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT1_LVLLIM</name>
               <description>Watchdog 1 Level Limits Register</description>
               <addressOffset>0x1234</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LVLMIN</name>
                     <description>Minimum Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>LVLMAX</name>
                     <description>Maximum Level</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT1_RLIM</name>
               <description>Watchdog 1 Repeat Limits Register</description>
               <addressOffset>0x1238</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RPTHMIN</name>
                     <description>Minimum Repeat Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>RPTHMAX</name>
                     <description>Maximum Repeat Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDT1_PLIM</name>
               <description>Watchdog 1 Period Limits Register</description>
               <addressOffset>0x123C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PERMIN</name>
                     <description>Minimum Period</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>PERMAX</name>
                     <description>Maximum Period</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
