Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX1025MTSH128S1.svd
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>PSR[%s]</name>
               <description>Protection Slave 0 Register</description>
               <addressOffset>0x0200</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LAUSERH0</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH1</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH2</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH3</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH4</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH5</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH6</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAUSERH7</name>
                     <description>Low Area USER in HSELx Protected Region</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH0</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH1</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH2</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH3</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH4</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH5</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH6</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDUSERH7</name>
                     <description>Read USER for HSELx Protected Region</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH0</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH1</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH2</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH3</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH4</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH5</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH6</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRUSERH7</name>
                     <description>Write USER for HSELx Protected Region</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA0</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA1</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA2</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA3</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA4</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA5</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA6</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPSOA7</name>
                     <description>Downward Protection Split Address for HSELx Protected Region</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>PASSR[%s]</name>
               <description>Protected Areas Split Slave 0 Register</description>
               <addressOffset>0x0240</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>PRTSR[%s]</name>
               <description>Protected Region Top Slave 0 Register</description>
               <addressOffset>0x0280</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRTOP0</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP1</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP2</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP3</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP4</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP5</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP6</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP7</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>3</dim>
               <dimIncrement>4</dimIncrement>
               <name>PPSELR[%s]</name>
               <description>Protected Peripheral Select 1 Register</description>
               <addressOffset>0x02C0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>USERP0</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP1</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP2</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP3</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP4</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP5</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP6</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP7</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP8</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP9</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP10</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP11</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP12</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP13</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP14</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP15</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP16</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP17</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP18</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP19</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP20</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP21</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP22</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP23</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP24</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP25</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP26</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP27</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP28</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP29</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP30</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERP31</name>
                     <description>User PSELy Peripheral</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
